{
  "title": "Mission & Vision",
  "paragraphs": [
    "Mathematics is crucial for economic development and for technical progress for any country that wants to remain competitive in the world economy. To meet the globally competitive ambitions of a knowledge-based economy the quality and size of the ‘pool’ of young people engaged in mainstream mathematics education is crucial. It is also this pool that feeds the supply of scientists needed within industry to perform the most demanding roles in areas that are crucial to the ongoing economic prosperity of the country. Mathematical skills underpin the attributes such as problem solving which are of critical importance within modern industrial environments. In order for adults to function (reasonably well) in an increasingly complex world, they require a basic level of mathematical knowledge which are necessary in a range of life-skills, such as personal finance and data-handling. Lack of sufficient mathematical skill and understanding affects one’s ability to make critically important educational, life, and career decisions. Thus Mathematics is a core skill for life.",
    "In spite of its importance, “Math” is a 4-letter word that evokes emotions ranging from dislike and anxiety to outright fear. Students fall below their expected level of mathematics achievement for a variety of reasons. When asked why they were not as successful in learning mathematics, many people reply that they “never understood math,” or “never liked it because it was too abstract and did not relate to them.”",
    "Mathematics is abstract. It does not have a shape. Children cannot see it. They need to visualize properly for solving a mathematical problem. Visualization comes from the everyday experience and relating mathematics with it requires a very strong trainer. Converting word problems into mathematical equation requires good understanding of the language and math fundamentals. Fundamentals are still taught in old-fashioned way in the school. Teachers teach fundamental without much of illustration therefore, students are not able to visualize the problem when they face it. They try to learn mathematics much like other subjects where they memorize facts and figures.",
    "Mathematics wants a thorough and good understanding. Students are confused by words that also have special mathematical meaning, such as “volume,” “yard,” “power,” and “area.” Lack of understanding of mathematical terms such as “divisor,” “factor,” “multiple,” and “denominator” seriously hampers students’ abilities to focus on and understand terms and operations for algorithms and problem solving. Memorizing these terms without meaning and context is not productive. Another major contributor to the difficulty of mathematics is lack of innovation in conventional system of teaching. The conventional system of teaching makes mathematics a dud and boring subject. Students are unable to visualize the concept taught by the teacher. Therefore, their interest level goes down. Hence they start developing a disassociation with the subject. If this disassociation continues for a longer period of time child starts hating mathematics.",
    "We started POORWA Tutorials & poorwatutorials.in to help students to overcome this Math phobia through various tools & techniques so that they gradually start loving Math. Our mission is to create a learning environment that will help students to enjoy and appreciate the value of mathematics, to develop the tools they need for varied educational and career options, and to function effectively as citizens. Our vision of excellent mathematical education is based on the twin premises that all students can learn mathematics and that all students need to learn mathematics. It is therefore imperative that we offer mathematics education of the very highest quality to all children. We believe that Mathematics instruction must provide many opportunities for concept building, relevant challenging questions, problem solving, reasoning, and connections within the curriculum and real-world situations.",
    "We offers practice exercises, instructional videos, and tutorials that empower students to study at their own pace in and outside of the classroom. It’s fun & free. We believe that money shouldn’t be a barrier to good education. In fact, the only barrier to education must be an individual’s thirst for knowledge."
  ]
}
